# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv10m with optimized DSFB and AMSA for better accuracy-speed balance
# Model docs: https://docs.ultralytics.com/models/yolov10
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels] - Conservative scaling for stability
  m: [0.67, 0.75, 768]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # Keep original C2f for early layers
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, DSFB, [256, 256, 2]] # DSFB with 2 blocks for small objects
  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16
  - [-1, 6, DSFB, [512, 512, 2]] # DSFB for medium objects
  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, DSFB, [1024, 1024, 1]] # Single block for large objects
  - [-1, 1, SPPF, [1024, 5]] # 9 - Keep SPPF
  - [-1, 1, AMSA, [1024]] # 10 - Add AMSA for global attention

# Head - Balanced approach
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 13 - Keep C2f for stability

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] 
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, DSFB, [256, 256, 1]] # 16 (P3/8-small) - DSFB for small object head

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512, True]] # 19 (P4/16-medium) - Keep original

  - [-1, 1, SCDown, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024, True]] # 22 (P5/32-large) - Keep original

  - [[16, 19, 22], 1, v10Detect, [nc]] # Detect(P3, P4, P5)